XMLInputData/CreateClientHeadOffice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://www.sonatacentral.com/service/v30/common/client" xmlns:ser="http://www.sonatacentral.com/service/v30/Service" xmlns:cal="http://www.sonatacentral.com/service/v30/CallerDetails" xmlns:cli1="http://www.sonatacentral.com/service/v30/globaltypes/common/client/ClientGroupType" xmlns:iden="http://www.sonatacentral.com/service/v30/globaltypes/IdentifierType" xmlns:dat="http://www.sonatacentral.com/service/v30/globaltypes/common/data/DataGroupType" xmlns:mod="http://www.sonatacentral.com/service/v30/globaltypes/common/Model" xmlns:acc="http://www.sonatacentral.com/service/v30/globaltypes/wrap/account/AccountGroupType" xmlns:tran="http://www.sonatacentral.com/service/v30/globaltypes/wrap/transaction/TransactionGroupType">
   <soapenv:Header/>
   <soapenv:Body>
      <cli:createClientRequest>
         <ser:CallerDetails>
            <cal:username>demo</cal:username>
            <cal:country>ZA</cal:country>
            <cal:language>EN</cal:language>
            <cal:databaseIdentifier>SonataDatasourceDev</cal:databaseIdentifier>
         </ser:CallerDetails>
         <cli:client>
            <cli1:clientDetails>
               <cli1:typeCode>
                  <dat:code>COMP</dat:code>
                  <dat:codeType>CLTY</dat:codeType>
               </cli1:typeCode>
               <cli1:surname>sClientHeadoffice</cli1:surname>
               <cli1:forename>Adam</cli1:forename>
               <cli1:title>
                  <dat:code>MR</dat:code>
                  <dat:codeType>TITL</dat:codeType>
               </cli1:title>
               <cli1:forename2>Conan</cli1:forename2>
               <cli1:initials>AC</cli1:initials>
               <cli1:salutation>Dear Mr Bravo</cli1:salutation>
               <cli1:gender>
                  <dat:code>MALE</dat:code>
                  <dat:codeType>SEX</dat:codeType>
               </cli1:gender>
               <cli1:dateOfBirth>1985-10-10T00:00:00.000+12:00</cli1:dateOfBirth>
               <cli1:ageAdmitted>false</cli1:ageAdmitted>
               <cli1:country>
                  <dat:code>ZA</dat:code>
               </cli1:country>
               <cli1:homePhone>+61 9 828 1934</cli1:homePhone>
               <cli1:mobilePhone>+61 27 4120 978</cli1:mobilePhone>
               <cli1:disclaimerSigned>true</cli1:disclaimerSigned>
               <cli1:mailingName>AC Bravo</cli1:mailingName>
               <cli1:status>
                  <dat:code>ALIV</dat:code>
                  <dat:codeType>CLST</dat:codeType>
               </cli1:status>
               <cli1:holdCorrespondence>false</cli1:holdCorrespondence>
               <cli1:canSolicit>false</cli1:canSolicit>
               <cli1:preferredRisk>
                  <dat:code>NSMK</dat:code>
                  <dat:codeType>RISK</dat:codeType>
               </cli1:preferredRisk>
               <cli1:secureSalaryFlag>false</cli1:secureSalaryFlag>
               <cli1:investorTypeCompany>
                  <dat:code>CORP</dat:code>
                  <dat:codeType>INTC</dat:codeType>
               </cli1:investorTypeCompany>
            </cli1:clientDetails>
            <cli1:address>
               <cli1:typeCode>
                  <dat:code>RESI</dat:code>
                  <dat:codeType>ADDR</dat:codeType>
               </cli1:typeCode>
               <cli1:primaryType>true</cli1:primaryType>
               <cli1:primary>true</cli1:primary>
               <cli1:line1>76 Kitchener Road</cli1:line1>
               <cli1:suburb>Johansburg</cli1:suburb>
               <cli1:city>Capetown</cli1:city>
               <cli1:postcode>1007</cli1:postcode>
               <cli1:country>
                  <dat:code>ZA</dat:code>
               </cli1:country>
            </cli1:address>
            <cli1:address>
               <cli1:typeCode>
                  <dat:code>EMAL</dat:code>
                  <dat:codeType>ADDR</dat:codeType>
               </cli1:typeCode>
               <cli1:primaryType>true</cli1:primaryType>
               <cli1:primary>false</cli1:primary>
               <cli1:line1>ap2@hotmail.com</cli1:line1>
               <cli1:country>
                  <dat:code>ZA</dat:code>
               </cli1:country>
            </cli1:address>
            <cli1:advisorGroup>
               <cli1:relationshipType>
                  <iden:name>Fin Adviser</iden:name>
                  <dat:code>BROK</dat:code>
               </cli1:relationshipType>
               <cli1:effectiveDate>2018-07-01T00:00:00.000</cli1:effectiveDate>
               <cli1:advisorSplit>
                  <cli1:advisor>
                     <cli1:advisorNumber>SA2</cli1:advisorNumber>
                  </cli1:advisor>
                  <cli1:percentageSplit>100</cli1:percentageSplit>
                  <cli1:primary>true</cli1:primary>
               </cli1:advisorSplit>
            </cli1:advisorGroup>
            <cli1:advisorGroup>
               <cli1:relationshipType>
                  <iden:name>Int House Admn</iden:name>
                  <dat:code>CMAD</dat:code>
               </cli1:relationshipType>
               <cli1:effectiveDate>2018-07-01T00:00:00.000</cli1:effectiveDate>
               <cli1:advisorSplit>
                  <cli1:advisor>
                     <cli1:advisorNumber>SA2</cli1:advisorNumber>
                  </cli1:advisor>
                  <cli1:percentageSplit>100</cli1:percentageSplit>
                  <cli1:primary>true</cli1:primary>
               </cli1:advisorSplit>
            </cli1:advisorGroup>
            <cli1:advisorGroup>
               <cli1:relationshipType>
                  <iden:name>Service FA</iden:name>
                  <dat:code>SERV</dat:code>
               </cli1:relationshipType>
               <cli1:effectiveDate>2018-07-01T00:00:00.000</cli1:effectiveDate>
               <cli1:advisorSplit>
                  <cli1:advisor>
                     <cli1:advisorNumber>SA2</cli1:advisorNumber>
                  </cli1:advisor>
                  <cli1:percentageSplit>100</cli1:percentageSplit>
                  <cli1:primary>true</cli1:primary>
               </cli1:advisorSplit>
            </cli1:advisorGroup>
            <cli1:advisorGroup>
               <cli1:relationshipType>
                  <iden:name>Fin Adv Assist</iden:name>
                  <dat:code>BRAS</dat:code>
               </cli1:relationshipType>
               <cli1:effectiveDate>2018-07-01T00:00:00.000</cli1:effectiveDate>
               <cli1:advisorSplit>
                  <cli1:advisor>
                     <cli1:advisorNumber>SA2</cli1:advisorNumber>
                  </cli1:advisor>
                  <cli1:percentageSplit>100</cli1:percentageSplit>
                  <cli1:primary>true</cli1:primary>
               </cli1:advisorSplit>
            </cli1:advisorGroup>
         </cli:client>
      </cli:createClientRequest>
   </soapenv:Body>
</soapenv:Envelope>